window.consumptionData = {
      '優食類': {
        total: 5839,
        details: [
          '鑫營雞肉本舖 - 400元',
          '鮮乳 通化夜市店 - 184元',
          '麵匡匡拉麵食堂 台北安居店 - 640元',
          '聖瑪莉 民生店 - 212元',
          '牛魔王牛排館 饒河店 - 540元',
          '金小噹韓式烤肉便當專賣店 - 367元',
          '朝氣美濃商行 台北永春店 - 340元',
          '再睡5分鐘 南興華店 - 162元',
          '燈籠滷味 通化店 - 500元',
          '饒河夜市 金賞東山鴨頭 - 383元',
          '火山一鍋 - 501元',
          '鶴茶樓 鶴頂紅茶商店 - 176元',
          'I、m PASTA 延吉店 - 512元',
          '3733特大雞排 - 465元',
          '金小噹韓式烤肉便當專賣店 - 567元',
          'Mister Donut 內湖大潤 - 196元',
          'Semeur聖娜現烤麵 - 172元',
          '罈笑風生酸菜魚 信義店 - 536元',
          '艋舺雞排 台北饒河店 - 175元'
        ]
      },
      '優步類': {
        total: 1411,
        details: [
          'Q Taxi車隊 - 350元',
          'Q Taxi車隊 - 178元',
          '桃園皇冠大車隊 - 168元',
          'Q2 Taxi車隊 - 315元',
          '大慶大車隊 - 400元'
        ]
      },
      '連加類': {
        total: 1828,
        details: [
          '壽奶茶 信義店 - 140元',
          '晨間美味早午餐 - 130元',
          '壽奶茶 信義店 - 130元',
          '福洱商行-信義安 - 115元',
          '橘小安的店 - 185元',
          '早安美芝城_信義 - 463元',
          '早安美芝城_信義 - 45元'
        ]
      },
      'OP錢包類': {
        total: 694,
        details: [
          '統一超商 - 69元',
          '統一超商 - 99元',
          '統一超商 - 29元',
          '統一超商 - 45元',
          '統一超商 - 233元',
          '統一超商 - 169元',
          '統一超商 - 50元'
        ]
      },
      '全盈支付類': {
        total: 715,
        details: [
          '全家便利商店 - 55元',
          '全家便利商店 - 45元',
          '全家便利商店 - 59元',
          '全家便利商店 - 84元',
          '全家便利商店 - 45元',
          '全家便利商店 - 35元',
          '全家便利商店 - 10元',
          '全家便利商店 - 55元',
          '全家便利商店 - 48元',
          '全家便利商店 - 119元',
          '全家便利商店 - 160元'
        ]
      },
      '家樂福類': {
        total: 1583,
        details: [
          '台北松德店一般掃碼 - 716元',
          '台北松德店一般掃碼 - 341元',
          '台北松德店一般 - 526元'
        ]
      },
      '美廉社類': {
        total: 1113,
        details: [
          '信義虎林二店 - 340元',
          '信義虎林二店 - 78元',
          '信義虎林二店 - 324元',
          '信義虎林二店 - 371元'
        ]
      },
      '百貨公司類': {
        total: 3005,
        details: [
          '微風南山美食 - 260元',
          '潤泰旭展股份有限公司 - 1,573元',
          '愛買忠孝店 - 1,172元'
        ]
      },
      '數位服務類': {
        total: 6892,
        details: [
          'GOOGLE*YOUTUBEPREMIUM - 399元',
          'Amazon web services - 15元',
          'APPLE.COM/BILL - 190元',
          'TAOBAO.COM - 405元',
          'IHERB - 1,986元',
          'Google One - 466元',
          'Pchome - 1,996元',
          '0919*** - 1,036元',
          '各項國外交易服務費 - 399元'
        ]
      },
      '餐飲類': {
        total: 9459,
        details: [
          '麥味登北市敦南遠企店 - 130元',
          'BAR M - 5,280元',
          'Subway-松德餐廳 - 319元',
          '安心食品服務(摩斯) - 170元',
          '洋城義大利餐酒館內湖店 - 1,298元',
          'Mister Donut 內湖 - 153元',
          '酒條通洋酒信義松德店 - 899元',
          'KFC-台北永春 - 594元',
          '覓特咖啡館 - 555元'
        ]
      },
      '購物類': {
        total: 8892,
        details: [
          '商線-富錦樹文創科技 - 1,300元',
          '小林眼鏡-松德分公司 - 450元',
          'DECATHLON迪卡儂內湖店 - 4,790元',
          '屈臣氏S0557永吉店 - 501元',
          '屈臣氏S0557永吉店 - 478元',
          'SHOPLINE-Fromfarm - 1,324元',
          '財團法人基督教以琳書房 - 305元'
        ]
      },
      '寵物類': {
        total: 1046,
        details: [
          '寵物公園忠五店 - 1,046元'
        ]
      },
      '交通類': {
        total: 1380,
        details: [
          '中油-大武崙站 - 500元',
          '微笑單車股份有限公司 - 70元',
          '和雲行動服務股份有限公司 - 810元'
        ]
      },
      '娛樂類': {
        total: 8428,
        details: [
          '野柳海洋世界 - 1,800元',
          'WEB STORE FOR FOREIGNE - 3,091元',
          'TEAMLAB PLANETS TOKYO - 2,737元',
          '國外交易服務費 - 87元',
          'Web Store / TeamLab 服務費 - 713元'
        ]
      },
      '悠遊卡加值': {
        total: 1500,
        details: [
          '悠遊卡自動加值-台北捷運永春 - 500元',
          '悠遊卡自動加值-金玉堂批發廣場 - 500元',
          '悠遊卡自動加值-美廉社 - 500元'
        ]
      },
      '生活繳費': {
        total: 500,
        details: [
          '信用卡扣繳中華電信費 - 500元'
        ]
      },
      '回饋及退款': {
        total: -617,
        details: [
          'UBear卡一般消費1%現金回饋 - -5元',
          'UBear卡網購加碼2%現金回饋 - -9元',
          'TAOBAO.COM退款 - -595元',
          'TAOBAO.COM服務費退款 - -8元'
        ]
      }
    };